<?php

$books = ["Володар кілець" => ["Толкіен", 1954],
    "Гаррі Поттер та таємна кімната" => ["Джоан Роулінг", 1998],
    "Пригоди Шерлока Холмса" => ["Конан Дойл", 1892],
    "Зло під сонцем" => ["Агата Крісті", 1941],
];

ksort($books);
print_r($books);

function cmp($a, $b)
{ // callback-функція, яка визначає спосіб сортування (по рокам)
    // if ($a[0] < $b[0]) {
    //     return -1;
    // } elseif ($a[0] == $b[0]) {
    //     return 0;
    // } else {
    //     return 1;
    // }
    return ($a[1] <=> $b[1]);
}

uasort($books, function ($a, $b) {
    return ($a[1] <=> $b[1]);
}); 

foreach ($books as $key => $book) { // виводимо масив
    echo "$book[0]: \"$key\", $book[1]\n";
}